## Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [5]:
from env import get_connection
import pandas as pd
import numpy as np

In [6]:
url = get_connection('tidy_data')
query = '''
        SELECT * FROM attendance
        '''
df = pd.read_sql(query, url)

In [7]:
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [19]:
df = df.rename(columns={"Unnamed: 0": "name"}, errors= "raise")
df.head()

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [21]:
df_m=df.melt(id_vars='name', value_vars=['2018-01-01', '2018-01-02', '2018-01-03', 
                                   '2018-01-04', '2018-01-05', '2018-01-06', 
                                   '2018-01-07', '2018-01-08'])
df_m.head()

    name    variable value
0  Sally  2018-01-01     P
1   Jane  2018-01-01     A
2  Billy  2018-01-01     A
3   John  2018-01-01     P
4  Sally  2018-01-02     T

In [22]:
df_m['value'].value_counts()

T    14
P     9
A     6
H     3
Name: value, dtype: int64

In [23]:
df_m[df_m['name']=='Sally'].value_counts()

name   variable    value
Sally  2018-01-01  P        1
       2018-01-02  T        1
       2018-01-03  T        1
       2018-01-04  H        1
       2018-01-05  P        1
       2018-01-06  A        1
       2018-01-07  T        1
       2018-01-08  T        1
dtype: int64

In [24]:
df_ma= df_m.drop(columns='variable')
df_ma.head()

    name value
0  Sally     P
1   Jane     A
2  Billy     A
3   John     P
4  Sally     T

In [25]:
df_ma[df_ma['name']=='Sally'].value_counts()

name   value
Sally  T        4
       P        2
       A        1
       H        1
dtype: int64

In [34]:
sally = df_ma[df_ma['name']=='Sally']

In [55]:
sally[sally['value']=='T'].value_counts()

name   value
Sally  T        4
dtype: int64